<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Arithmetic Operators </h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Arithmetic operators are used to perform mathematical operations on numeric values within queries</div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Load Data</div>

In [1]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/mydb

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">+ ADDITION<ul>Adds two numeric values.</ul></div>

In [4]:
%%sql 
SELECT resolution_width,resolution_height FROM mobile 
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1080, 2412), (1080, 2408), (1080, 2408), (1080, 2400), (1080, 2408)]

In [7]:
%%sql 
SELECT resolution_width,resolution_height, 
resolution_width + resolution_height AS `resolution` FROM mobile 
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1080, 2412, 3492),
 (1080, 2408, 3488),
 (1080, 2408, 3488),
 (1080, 2400, 3480),
 (1080, 2408, 3488)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">- Subtraction<ul>Subtract two numeric values.</ul></div>

In [13]:
%%sql 
SELECT resolution_width,resolution_height, 
resolution_height - resolution_width AS `difference` FROM mobile 
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1080, 2412, 1332),
 (1080, 2408, 1328),
 (1080, 2408, 1328),
 (1080, 2400, 1320),
 (1080, 2408, 1328)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">* Multiplications</div>

In [14]:
%%sql 
SELECT resolution_width,resolution_height, 
resolution_height * resolution_width AS `multiply` FROM mobile 
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1080, 2412, 2604960),
 (1080, 2408, 2600640),
 (1080, 2408, 2600640),
 (1080, 2400, 2592000),
 (1080, 2408, 2600640)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">/ DIVISION</div>

In [15]:
%%sql 
SELECT resolution_width,resolution_height, 
resolution_height / resolution_width AS `division` FROM mobile 
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1080, 2412, Decimal('2.2333')),
 (1080, 2408, Decimal('2.2296')),
 (1080, 2408, Decimal('2.2296')),
 (1080, 2400, Decimal('2.2222')),
 (1080, 2408, Decimal('2.2296'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Bulit-in Function <ul>DIVIONS USE CEIL or FLOOR functions</ul><br><br>The CEIL function (also known as CEILING) rounds a numeric value up to the nearest integer that is greater than or equal to the original value.</div>

In [26]:
%%sql 
SELECT resolution_width,resolution_height, 
CEIL(resolution_height / resolution_width) `division_CEIL` FROM mobile 
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1080, 2412, Decimal('3')),
 (1080, 2408, Decimal('3')),
 (1080, 2408, Decimal('3')),
 (1080, 2400, Decimal('3')),
 (1080, 2408, Decimal('3'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">The FLOOR function rounds a numeric value down to the nearest integer that is less than or equal to the original value.</div>

In [27]:
%%sql 
SELECT resolution_width,resolution_height, 
FLOOR(resolution_height / resolution_width) `division_CEIL` FROM mobile 
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1080, 2412, Decimal('2')),
 (1080, 2408, Decimal('2')),
 (1080, 2408, Decimal('2')),
 (1080, 2400, Decimal('2')),
 (1080, 2408, Decimal('2'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">% MODULUS <ul>The modulus operator (%) is used to calculate the remainder of a division operation between two numeric values</ul></div>

In [30]:
%%sql 
SELECT resolution_width,resolution_height, 
resolution_height % resolution_width `modulus` FROM mobile 
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1080, 2412, 252),
 (1080, 2408, 248),
 (1080, 2408, 248),
 (1080, 2400, 240),
 (1080, 2408, 248)]

<hr>
<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Bitwise Operators </h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Bitwise operations in SQL involve manipulating individual bits of binary values.<br>These operations are typically used with integer data types.
</div>

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Bitwise  AND (&)<ul>The bitwise AND operation (&) is a binary operation that performs a bitwise AND between each pair of corresponding bits of two integers<br><br>return 1 if boths bits are 1 else return 0 </ul></div>

In [9]:
%%sql 
SELECT 
0 & 0,
0 & 1,
1 & 0,
1 & 1

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(0, 0, 0, 1)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Example 2</div>

# $$binary \;\;of \;\;10 \;\;is \;\;1010$$
# $$binary \;\;of \;\;15 \;\;is \;\;1111$$
<br><br>
<h1>
    $$1\;\;0\;\;1\;\;0$$
    $$1\;\;1\;\;1\;\;1$$
    $$ \rule{5cm}{1pt} $$
    <p style="color:red;">$$1\;\;0\;\;1\;\;0$$</p>
        $$ \rule{5cm}{1pt} $$<br>
    $$Decimal\;\;of\;\;1010\;\;is\;\;10$$


</h1>

In [41]:
%%sql 
SELECT 
1 & 1 AS `a`,
0 & 1 AS `b` ,
1 & 1 AS `c` ,
0 & 1 AS `d`

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(1, 0, 1, 0)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Bitwise  OR |<ul>return 1 if any one bits are 1 else return 0 </ul></div>

In [10]:
%%sql 
SELECT 
0 | 0,
0 | 1,
1 | 0,
1 | 1

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(0, 1, 1, 1)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Example 2</div>

# $$binary \;\;of \;\;10 \;\;is \;\;1010$$
# $$binary \;\;of \;\;15 \;\;is \;\;1111$$
<br><br>
<h1>
    $$1\;\;0\;\;1\;\;0$$
    $$1\;\;1\;\;1\;\;1$$
    $$ \rule{5cm}{1pt} $$
    <p style="color:red;">$$1\;\;1\;\;1\;\;1$$</p>
        $$ \rule{5cm}{1pt} $$<br>
    $$Decimal\;\;of\;\;1111\;\;is\;\;15$$


</h1>

In [42]:
%%sql 
SELECT 
1 | 1 AS `a`,
0 | 1 AS `b` ,
1 | 1 AS `c` ,
0 | 1 AS `d`

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(1, 1, 1, 1)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Xor  ^<ul>return 1 if only (single) one bits are 1 else return 0 </ul></div>

In [11]:
%%sql 
SELECT 
0 ^ 0,
0 ^ 1,
1 ^ 0,
1 ^ 1

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(0, 1, 1, 0)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Example 2</div>

# $$binary \;\;of \;\;10 \;\;is \;\;1010$$
# $$binary \;\;of \;\;15 \;\;is \;\;1111$$
<br><br>
<h1>
    $$1\;\;0\;\;1\;\;0$$
    $$1\;\;1\;\;1\;\;1$$
    $$ \rule{5cm}{1pt} $$
    <p style="color:red;">$$0\;\;1\;\;0\;\;1$$</p>
        $$ \rule{5cm}{1pt} $$<br>
    $$Decimal\;\;of\;\;0101\;\;is\;\;5$$


</h1>

In [44]:
%%sql 
SELECT 
1 ^ 1 AS `a`,
0 ^ 1 AS `b` ,
1 ^ 1 AS `c` ,
0 ^ 1 AS `d`

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(0, 1, 0, 1)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> << (Left Shift)  <ul>Shifts the bits of the number to the left and fills 0 on voids right as a result.<br>Similar effect as of multiplying the number with some power of two. </ul></div>

In [46]:
%%sql 
SELECT  14 << 2

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(56,)]

<img style="display: block;margin-left: auto;margin-right: auto;width: 50%;" src="../images/lshift.jpeg" width="150px" >

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> >> (Right Shift)  <ul>Shifts the bits of the number to the right and fills 0 on voids left( fills 1 in the case of a negative number) as a result.<br>Similar effect as of dividing the number with some power of two.  </ul></div>

In [13]:
%%sql 
SELECT  14 >> 2

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(3,)]

<img style="display: block;margin-left: auto;margin-right: auto;width: 50%;" src="../images/rshift.jpeg" width="150px" >

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> ~ NOT , Complement  <ul>Inverts all the bits<br><br><ul>The CAST function is used to explicitly convert or cast a value from one data type to another.<br>In this case, ~3 represents the bitwise NOT operation on the number 3.<br><br>The AS SIGNED part specifies that the result of the bitwise NOT operation should be cast to a signed integer type.  </ul></div>

In [51]:
%%sql 
SELECT CAST(~12 AS SIGNED) AS Result;

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(-13,)]

<img src="../images/once_cl.jpeg" width="450px" style="display: block;margin-left: auto;margin-right: auto;width: 50%;">
<img src="../images/sec_cl.jpeg" width="450px" style="display: block;margin-left: auto;margin-right: auto;width: 50%;">